packages/h1_parser.0.0.2/wrk_bench/http_go_maxprocs_1.txt
Running 1m test @ http://127.0.0.1:8080/
  8 threads and 10000 connections
  Thread calibration: mean lat.: 2.415ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.303ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.460ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.504ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.408ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.544ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.559ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 2.361ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.92ms   72.92ms   1.03s    98.47%
    Req/Sec     8.07k     4.93k  140.67k    87.43%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.64ms
 75.000%    2.78ms
 90.000%    6.44ms
 99.000%  397.31ms
 99.900%  919.55ms
 99.990%    1.01s 
 99.999%    1.03s 
100.000%    1.03s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.082     0.000000            2         1.00
       0.639     0.100000       262527         1.11
       0.886     0.200000       525144         1.25
       1.131     0.300000       788525         1.43
       1.383     0.400000      1050778         1.67
       1.642     0.500000      1312962         2.00
       1.781     0.550000      1444422         2.22
       1.936     0.600000      1575453         2.50
       2.119     0.650000      1707039         2.86
       2.359     0.700000      1838138         3.33
       2.775     0.750000      1968836         4.00
       3.087     0.775000      2034509         4.44
       3.457     0.800000      2100324         5.00
       3.949     0.825000      2165718         5.71
       4.559     0.850000      2231680         6.67
       5.351     0.875000      2297031         8.00
       5.847     0.887500      2329790         8.89
       6.443     0.900000      2362692        10.00
       7.175     0.912500      2395402        11.43
       8.095     0.925000      2428225        13.33
       9.295     0.937500      2461055        16.00
      10.079     0.943750      2477543        17.78
      11.055     0.950000      2493962        20.00
      12.351     0.956250      2510293        22.86
      14.199     0.962500      2526680        26.67
      17.167     0.968750      2543093        32.00
      19.263     0.971875      2551282        35.56
      21.919     0.975000      2559511        40.00
      25.631     0.978125      2567698        45.71
      31.167     0.981250      2575884        53.33
      48.287     0.984375      2584077        64.00
     161.407     0.985938      2588188        71.11
     248.319     0.987500      2592284        80.00
     344.831     0.989062      2596387        91.43
     435.455     0.990625      2600492       106.67
     524.031     0.992188      2604595       128.00
     569.343     0.992969      2606642       142.22
     616.959     0.993750      2608696       160.00
     663.551     0.994531      2610750       182.86
     705.535     0.995313      2612802       213.33
     750.079     0.996094      2614852       256.00
     774.143     0.996484      2615873       284.44
     800.255     0.996875      2616908       320.00
     823.295     0.997266      2617926       365.71
     844.799     0.997656      2618962       426.67
     864.255     0.998047      2619968       512.00
     877.567     0.998242      2620491       568.89
     888.319     0.998437      2621007       640.00
     900.095     0.998633      2621516       731.43
     911.359     0.998828      2622044       853.33
     921.087     0.999023      2622533      1024.00
     927.743     0.999121      2622804      1137.78
     934.911     0.999219      2623066      1280.00
     942.079     0.999316      2623302      1462.86
     958.975     0.999414      2623561      1706.67
     968.703     0.999512      2623818      2048.00
     974.847     0.999561      2623943      2275.56
     981.503     0.999609      2624073      2560.00
     988.159     0.999658      2624212      2925.71
     991.743     0.999707      2624330      3413.33
     995.839     0.999756      2624457      4096.00
     999.423     0.999780      2624522      4551.11
    1000.959     0.999805      2624583      5120.00
    1003.519     0.999829      2624650      5851.43
    1005.567     0.999854      2624711      6826.67
    1009.151     0.999878      2624786      8192.00
    1009.663     0.999890      2624811      9102.22
    1010.687     0.999902      2624838     10240.00
    1012.735     0.999915      2624871     11702.86
    1014.783     0.999927      2624910     13653.33
    1015.807     0.999939      2624943     16384.00
    1016.319     0.999945      2624953     18204.44
    1016.831     0.999951      2624970     20480.00
    1017.343     0.999957      2624986     23405.71
    1017.855     0.999963      2624998     27306.67
    1018.879     0.999969      2625015     32768.00
    1019.391     0.999973      2625022     36408.89
    1020.415     0.999976      2625030     40960.00
    1022.463     0.999979      2625042     46811.43
    1023.487     0.999982      2625048     54613.33
    1024.511     0.999985      2625056     65536.00
    1025.023     0.999986      2625062     72817.78
    1025.023     0.999988      2625062     81920.00
    1025.535     0.999989      2625067     93622.86
    1026.047     0.999991      2625071    109226.67
    1027.071     0.999992      2625077    131072.00
    1027.071     0.999993      2625077    145635.56
    1027.583     0.999994      2625080    163840.00
    1027.583     0.999995      2625080    187245.71
    1028.095     0.999995      2625083    218453.33
    1028.607     0.999996      2625085    262144.00
    1028.607     0.999997      2625085    291271.11
    1029.119     0.999997      2625088    327680.00
    1029.119     0.999997      2625088    374491.43
    1029.119     0.999998      2625088    436906.67
    1029.631     0.999998      2625089    524288.00
    1030.143     0.999998      2625091    582542.22
    1030.143     0.999998      2625091    655360.00
    1030.143     0.999999      2625091    748982.86
    1030.143     0.999999      2625091    873813.33
    1030.655     0.999999      2625094   1048576.00
    1030.655     1.000000      2625094          inf
#[Mean    =       10.918, StdDeviation   =       72.922]
#[Max     =     1030.144, Total count    =      2625094]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3411748 requests in 1.00m, 6.97GB read
Requests/sec:  56862.07
Transfer/sec:    119.03MB