packages/h1_parser.0.0.2/wrk_bench/rust_warp_single_thread.txt
Running 2m test @ http://127.0.0.1:8080/
  8 threads and 10000 connections
  Thread calibration: mean lat.: 11.873ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 12.170ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 12.123ms, rate sampling interval: 14ms
  Thread calibration: mean lat.: 12.419ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 12.530ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 12.160ms, rate sampling interval: 14ms
  Thread calibration: mean lat.: 12.268ms, rate sampling interval: 14ms
  Thread calibration: mean lat.: 12.408ms, rate sampling interval: 12ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.55ms   27.34ms   1.02s    99.77%
    Req/Sec     7.86k     3.12k  113.64k    84.39%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.55ms
 75.000%    2.41ms
 90.000%    5.80ms
 99.000%   13.69ms
 99.900%  559.10ms
 99.990%  929.79ms
 99.999%    1.01s 
100.000%    1.02s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.067     0.000000            1         1.00
       0.616     0.100000       623545         1.11
       0.846     0.200000      1246557         1.25
       1.073     0.300000      1869249         1.43
       1.308     0.400000      2492116         1.67
       1.551     0.500000      3113467         2.00
       1.678     0.550000      3426189         2.22
       1.811     0.600000      3736240         2.50
       1.966     0.650000      4047652         2.86
       2.149     0.700000      4360199         3.33
       2.415     0.750000      4669488         4.00
       2.645     0.775000      4825282         4.44
       2.999     0.800000      4980883         5.00
       3.447     0.825000      5136554         5.71
       4.057     0.850000      5291637         6.67
       4.811     0.875000      5447238         8.00
       5.271     0.887500      5525172         8.89
       5.799     0.900000      5603171        10.00
       6.403     0.912500      5680911        11.43
       7.095     0.925000      5758753        13.33
       7.855     0.937500      5836613        16.00
       8.263     0.943750      5875589        17.78
       8.703     0.950000      5914647        20.00
       9.175     0.956250      5953534        22.86
       9.687     0.962500      5992121        26.67
      10.263     0.968750      6031220        32.00
      10.583     0.971875      6050612        35.56
      10.943     0.975000      6069950        40.00
      11.343     0.978125      6089498        45.71
      11.791     0.981250      6108875        53.33
      12.327     0.984375      6128271        64.00
      12.647     0.985938      6138045        71.11
      13.007     0.987500      6147657        80.00
      13.415     0.989062      6157308        91.43
      13.887     0.990625      6167071       106.67
      14.463     0.992188      6176759       128.00
      14.807     0.992969      6181668       142.22
      15.207     0.993750      6186511       160.00
      15.671     0.994531      6191360       182.86
      16.279     0.995313      6196198       213.33
      17.103     0.996094      6201110       256.00
      17.647     0.996484      6203522       284.44
      18.399     0.996875      6205960       320.00
      19.807     0.997266      6208347       365.71
      27.759     0.997656      6210778       426.67
     164.351     0.998047      6213210       512.00
     245.375     0.998242      6214426       568.89
     324.607     0.998437      6215648       640.00
     408.063     0.998633      6216863       731.43
     490.239     0.998828      6218079       853.33
     570.367     0.999023      6219294      1024.00
     607.743     0.999121      6219899      1137.78
     651.775     0.999219      6220506      1280.00
     689.151     0.999316      6221115      1462.86
     736.767     0.999414      6221721      1706.67
     773.119     0.999512      6222333      2048.00
     794.623     0.999561      6222638      2275.56
     816.639     0.999609      6222943      2560.00
     834.047     0.999658      6223245      2925.71
     850.943     0.999707      6223548      3413.33
     873.471     0.999756      6223854      4096.00
     882.687     0.999780      6224004      4551.11
     892.927     0.999805      6224155      5120.00
     903.167     0.999829      6224306      5851.43
     910.335     0.999854      6224457      6826.67
     923.135     0.999878      6224613      8192.00
     927.231     0.999890      6224697      9102.22
     930.815     0.999902      6224771     10240.00
     938.495     0.999915      6224838     11702.86
     951.807     0.999927      6224918     13653.33
     959.487     0.999939      6224993     16384.00
     965.631     0.999945      6225027     18204.44
     972.287     0.999951      6225066     20480.00
     977.919     0.999957      6225104     23405.71
     984.063     0.999963      6225141     27306.67
     990.207     0.999969      6225179     32768.00
     993.279     0.999973      6225198     36408.89
     995.327     0.999976      6225222     40960.00
     999.935     0.999979      6225237     46811.43
    1001.983     0.999982      6225257     54613.33
    1004.543     0.999985      6225276     65536.00
    1006.079     0.999986      6225285     72817.78
    1008.127     0.999988      6225295     81920.00
    1009.663     0.999989      6225302     93622.86
    1010.687     0.999991      6225316    109226.67
    1011.711     0.999992      6225325    131072.00
    1012.735     0.999993      6225330    145635.56
    1013.247     0.999994      6225333    163840.00
    1013.759     0.999995      6225335    187245.71
    1016.319     0.999995      6225340    218453.33
    1016.831     0.999996      6225345    262144.00
    1017.343     0.999997      6225351    291271.11
    1017.343     0.999997      6225351    327680.00
    1017.855     0.999997      6225357    374491.43
    1017.855     0.999998      6225357    436906.67
    1017.855     0.999998      6225357    524288.00
    1018.367     0.999998      6225364    582542.22
    1018.367     0.999998      6225364    655360.00
    1018.367     0.999999      6225364    748982.86
    1018.367     0.999999      6225364    873813.33
    1018.367     0.999999      6225364   1048576.00
    1018.367     0.999999      6225364   1165084.44
    1018.367     0.999999      6225364   1310720.00
    1018.367     0.999999      6225364   1497965.71
    1018.879     0.999999      6225365   1747626.67
    1019.391     1.000000      6225368   2097152.00
    1019.391     1.000000      6225368          inf
#[Mean    =        3.554, StdDeviation   =       27.337]
#[Max     =     1018.880, Total count    =      6225368]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  7011744 requests in 2.00m, 14.18GB read
Requests/sec:  58431.64
Transfer/sec:    121.03MB